HW2/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title
SELECT "movies".* FROM "movies"
---
  def index
    if params[:sort] == 'title'
      @movies = Movie.order("title")
    else
      @movies = Movie.all